[
    {
        "image": "https://i.ibb.co.com/QFpmwpr3/youtube.png",
        "title": "YouTube",
        "companyName": "Google LLC",
        "id": 1,
        "description": "YouTube is the world’s largest video-sharing platform, allowing users to watch, upload, and share videos across a wide range of categories including music, entertainment, education, gaming, vlogs, and more. It provides a platform for creators to build communities, monetize content, and engage with audiences globally. Users can subscribe to channels, create playlists, leave comments, and participate in live streams. YouTube’s intelligent recommendation system helps viewers discover new content tailored to their interests, while its search functionality makes it easy to find specific videos or topics. The platform also supports high-quality video playback up to 4K and beyond, including HDR content for enhanced viewing experiences. YouTube offers personalized features like watch history, notifications for favorite channels, and offline downloads through YouTube Premium. In addition to entertainment, YouTube serves as a valuable resource for learning, offering tutorials, courses, and webinars on countless subjects. Its community guidelines and content moderation policies help maintain a safe and respectful environment. YouTube is available on mobile, desktop, smart TVs, and various streaming devices, making it accessible anytime, anywhere. Its integration with Google accounts allows seamless access across services. Whether you want to explore trending videos, follow favorite creators, or upload your own content, YouTube provides an engaging, dynamic, and user-friendly experience for audiences of all ages.",
        "size": 180,
        "reviews": 154000000,
        "ratingAvg": 4.5,
        "downloads": 10000000000,
        "ratings": [
            {
                "name": "1 star",
                "count": 1200000
            },
            {
                "name": "2 star",
                "count": 2200000
            },
            {
                "name": "3 star",
                "count": 7500000
            },
            {
                "name": "4 star",
                "count": 22000000
            },
            {
                "name": "5 star",
                "count": 123000000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/mV7bw1Rc/Pngtree-instagram-icon-8704817.png",
        "title": "Instagram",
        "companyName": "Meta Platforms, Inc.",
        "id": 2,
        "description": "Instagram is a social media platform designed for sharing photos, videos, and stories, connecting with friends, and discovering trends worldwide. With its intuitive interface, users can capture and edit photos or videos using advanced filters, effects, and creative tools, making content visually appealing. Instagram’s features include Stories, Reels, IGTV, and the recently added Notes and Collabs, allowing for dynamic engagement and collaboration with other users or creators. The platform enables following accounts, liking posts, commenting, and sending private messages through Direct. Users can explore trending content globally through the Explore page, discover new creators, brands, or products, and engage with communities that share similar interests. Instagram also provides professional tools such as business profiles, analytics, and promotional options to help creators and businesses grow their audience and reach. It emphasizes visual storytelling, making it a hub for lifestyle, fashion, travel, food, and creative inspiration. Security and privacy features allow users to control their visibility, manage followers, and report inappropriate content. Available across mobile devices and web browsers, Instagram continuously evolves to provide interactive, fun, and meaningful ways to connect with people, showcase creativity, and experience the latest trends in culture and entertainment.",
        "size": 140,
        "reviews": 135000000,
        "ratingAvg": 4.4,
        "downloads": 10000000000,
        "ratings": [
            {
                "name": "1 star",
                "count": 1600000
            },
            {
                "name": "2 star",
                "count": 2400000
            },
            {
                "name": "3 star",
                "count": 8400000
            },
            {
                "name": "4 star",
                "count": 26000000
            },
            {
                "name": "5 star",
                "count": 97000000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/5hcgXBtN/spotify.png",
        "title": "Spotify",
        "companyName": "Spotify AB",
        "id": 3,
        "description": "Spotify is a leading music streaming platform that offers access to millions of songs, albums, playlists, and podcasts from artists around the globe. Users can discover new music tailored to their taste through personalized recommendations, curated playlists, and the innovative Discover Weekly and Daily Mix features. Spotify allows users to create their own playlists, follow favorite artists, and share music with friends via social media or direct links. Its podcast library spans a wide range of topics including entertainment, education, news, health, and storytelling. The platform supports offline playback, high-quality audio streaming, and cross-device synchronization, ensuring seamless listening experiences on mobile phones, desktops, smart speakers, or wearable devices. Premium subscription options provide ad-free listening, unlimited skips, and enhanced sound quality. Spotify also offers tools for artists to track performance metrics, engage with fans, and release music efficiently. Its interface is user-friendly, featuring search capabilities, genre-specific stations, and collaborative playlists. With a focus on discovery, personalization, and accessibility, Spotify has become a central platform for music lovers, podcast enthusiasts, and content creators, connecting audiences to audio experiences that inspire, entertain, and inform. It combines technology and creativity to redefine how people experience sound globally.",
        "size": 120,
        "reviews": 115000000,
        "ratingAvg": 4.6,
        "downloads": 1000000000,
        "ratings": [
            {
                "name": "1 star",
                "count": 900000
            },
            {
                "name": "2 star",
                "count": 1800000
            },
            {
                "name": "3 star",
                "count": 6500000
            },
            {
                "name": "4 star",
                "count": 20000000
            },
            {
                "name": "5 star",
                "count": 87000000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/spHvkMH7/tiktok.jpg",
        "title": "TikTok",
        "companyName": "ByteDance Ltd.",
        "id": 4,
        "description": "TikTok is a social media platform designed for creating, sharing, and discovering short-form videos that entertain, inspire, and connect millions of users worldwide. It allows creators to produce engaging content using an extensive library of sounds, music tracks, filters, effects, and editing tools. Users can watch personalized video feeds powered by TikTok’s intelligent algorithm, which recommends content based on interests, interaction history, and trending challenges. The platform supports viral trends, duets, reactions, and collaborative content, making it highly interactive and community-driven. TikTok is widely used for comedy, dance, lip-syncing, education, DIY projects, and viral campaigns. Its live streaming feature allows creators to engage with audiences in real-time, while TikTok Shop integrates e-commerce opportunities for creators and brands. The app prioritizes user experience with smooth scrolling, intuitive interface design, and features like “For You Page” (FYP) to discover trending content globally. TikTok also emphasizes safety and content moderation, offering privacy settings, parental controls, and reporting tools. Available on mobile devices and accessible across regions, TikTok has revolutionized digital content consumption, making it a hub for creativity, entertainment, learning, and social connection. It has empowered creators to reach global audiences, influence culture, and express themselves in unique and compelling ways.",
        "size": 150,
        "reviews": 118000000,
        "ratingAvg": 4.3,
        "downloads": 5000000000,
        "ratings": [
            {
                "name": "1 star",
                "count": 2000000
            },
            {
                "name": "2 star",
                "count": 3000000
            },
            {
                "name": "3 star",
                "count": 8000000
            },
            {
                "name": "4 star",
                "count": 25000000
            },
            {
                "name": "5 star",
                "count": 80000000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/XxZcLLpG/google-photos.png",
        "title": "Google Photos",
        "companyName": "Google LLC",
        "id": 5,
        "description": "Google Photos is a cloud-based photo and video management service designed to help users backup, organize, and share their memories effortlessly. With its intelligent storage and AI-driven features, Google Photos automatically organizes photos by people, places, and events, making it easy to search and locate specific images. The platform offers advanced editing tools, filters, and enhancements to improve visual quality, as well as options to create albums, collages, movies, and animations. Google Photos seamlessly syncs across devices, ensuring that users can access their media from smartphones, tablets, or desktops at any time. Sharing features allow users to send photos or albums directly to friends and family, collaborate on shared albums, or generate private links. The platform’s AI-powered features include automatic suggestions for photo enhancements, duplicate detection, and facial recognition to categorize and group images accurately. With privacy controls, users can manage who can view or edit their content. Google Photos also integrates with Google Drive and other Google services, providing a cohesive experience across the ecosystem. Its user-friendly interface, intelligent search, and cloud backup capabilities make it a reliable, versatile, and convenient solution for preserving and reliving important moments, while also offering creative tools to transform memories into meaningful stories.",
        "size": 110,
        "reviews": 82000000,
        "ratingAvg": 4.5,
        "downloads": 5000000000,
        "ratings": [
            {
                "name": "1 star",
                "count": 800000
            },
            {
                "name": "2 star",
                "count": 1300000
            },
            {
                "name": "3 star",
                "count": 4200000
            },
            {
                "name": "4 star",
                "count": 12000000
            },
            {
                "name": "5 star",
                "count": 63000000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/9HM755PF/whats-app.png",
        "title": "WhatsApp",
        "companyName": "Meta Platforms, Inc.",
        "id": 6,
        "description": "WhatsApp is a globally trusted messaging and calling application that allows users to communicate securely and instantly with friends, family, and colleagues. It supports text messaging, voice and video calls, multimedia sharing, and group chats, all encrypted end-to-end for maximum privacy. Users can share photos, videos, documents, and voice messages seamlessly, and communicate in individual or group conversations with up to hundreds of participants. WhatsApp Status allows users to post temporary updates that disappear after 24 hours, while broadcast lists facilitate sending messages to multiple contacts at once. The platform also supports voice notes, location sharing, and integration with WhatsApp Web for desktop use. Businesses can use WhatsApp Business to connect with customers, provide support, and manage automated messages. The application prioritizes user security, offering two-step verification, account recovery, and privacy settings to control who sees personal information or status updates. WhatsApp’s intuitive interface, minimalistic design, and consistent performance across devices make it suitable for both casual users and professionals. It has become an essential tool for global communication, combining efficiency, reliability, and security to keep people connected in real-time. With billions of users worldwide, WhatsApp continues to innovate with features that enhance social interaction and business engagement.",
        "size": 95,
        "reviews": 160000000,
        "ratingAvg": 4.4,
        "downloads": 10000000000,
        "ratings": [
            {
                "name": "1 star",
                "count": 1300000
            },
            {
                "name": "2 star",
                "count": 1900000
            },
            {
                "name": "3 star",
                "count": 7100000
            },
            {
                "name": "4 star",
                "count": 21000000
            },
            {
                "name": "5 star",
                "count": 128000000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/KzXf66QH/facebook.png",
        "title": "Facebook",
        "companyName": "Meta Platforms, Inc.",
        "id": 7,
        "description": "Facebook is a comprehensive social networking platform that connects millions of users worldwide, enabling them to share experiences, memories, and updates with friends and family. Users can create personal profiles, post status updates, photos, and videos, and interact through likes, comments, and shares. Facebook’s News Feed offers a personalized stream of content, displaying posts from friends, followed pages, and recommended content tailored to user interests. The platform also supports Groups for communities, Pages for brands and creators, and Events for organizing gatherings or activities. Messaging is facilitated through Facebook Messenger, which offers instant chat, voice and video calls, and media sharing. Facebook Marketplace allows users to buy and sell products locally, while features like Reels and Stories provide creative ways to engage audiences. The platform employs algorithms to surface relevant content, advertisements, and friend suggestions. Privacy and security tools let users control profile visibility, manage blocked accounts, and report inappropriate content. Available on mobile, web, and tablet devices, Facebook remains a versatile hub for social interaction, networking, entertainment, and news consumption. Its continual evolution ensures users can stay connected, informed, and engaged with a global community, making it a central platform for social engagement and digital communication.",
        "size": 160,
        "reviews": 198000000,
        "ratingAvg": 4.2,
        "downloads": 10000000000,
        "ratings": [
            {
                "name": "1 star",
                "count": 2700000
            },
            {
                "name": "2 star",
                "count": 4000000
            },
            {
                "name": "3 star",
                "count": 8800000
            },
            {
                "name": "4 star",
                "count": 22000000
            },
            {
                "name": "5 star",
                "count": 160000000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/bR8knQqM/gmail.jpg",
        "title": "Gmail",
        "companyName": "Google LLC",
        "id": 8,
        "description": "Gmail is a widely used email service by Google that offers reliable, fast, and secure communication for personal, educational, and professional purposes. It provides a clean and user-friendly interface with features such as threaded conversations, labels, categories, and advanced search to help users organize and manage emails efficiently. Gmail integrates seamlessly with Google Workspace, including Google Drive, Calendar, Meet, and Chat, enabling users to collaborate and communicate effectively in real-time. It supports attachments, including documents, photos, and files, with preview options and safe downloading. Gmail employs robust spam filters and AI-powered protection against phishing and malware, ensuring inbox security. Users can schedule emails, set reminders, and create automated filters to streamline workflow. Customization options include themes, signature management, and multiple account support. Its mobile and web applications offer consistent performance, offline access, and synchronization across devices. Gmail also supports labels, stars, and priority inbox features to highlight important messages. With billions of active users globally, Gmail combines simplicity, organization, and advanced functionality to make email communication faster, safer, and more productive. It remains a cornerstone in personal and professional digital communication.",
        "size": 130,
        "reviews": 92000000,
        "ratingAvg": 4.6,
        "downloads": 10000000000,
        "ratings": [
            {
                "name": "1 star",
                "count": 700000
            },
            {
                "name": "2 star",
                "count": 900000
            },
            {
                "name": "3 star",
                "count": 3200000
            },
            {
                "name": "4 star",
                "count": 11000000
            },
            {
                "name": "5 star",
                "count": 77000000
            }
        ]
    }
]